{
  "_class_name": "MarigoldPipeline",
  "_diffusers_version": "0.29.2",
  "_name_or_path": "prs-eth/marigold-v1-0",
  "default_denoising_steps": 10,
  "default_processing_resolution": 768,
  "scale_invariant": true,
  "scheduler": [
    "diffusers",
    "DDIMScheduler"
  ],
  "shift_invariant": true,
  "text_encoder": [
    "transformers",
    "CLIPTextModel"
  ],
  "tokenizer": [
    "transformers",
    "CLIPTokenizer"
  ],
  "unet": [
    "diffusers",
    "UNet2DConditionModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKL"
  ]
}
